# **6 - Loading**

## Import Libraries

In [114]:
from sqlalchemy import create_engine, text
import csv
import pandas as pd

## Connect to Database

In [115]:
engine = create_engine('postgresql://bryguan:qwertyuiop@localhost:5432/acme')
connection = engine.connect().execution_options(auto_commit = True)

## Drop Existing Tables

### Customers

In [116]:
query = '''

DROP TABLE IF EXISTS customers_2;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Line Items

In [117]:
query = '''

DROP TABLE IF EXISTS line_items_2;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Product Mapping

In [118]:
query = '''

DROP TABLE IF EXISTS product_mappings_2;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Sales

In [119]:
query = '''

DROP TABLE IF EXISTS sales_2;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Stores

In [120]:
query = '''

DROP TABLE IF EXISTS stores_2;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

## Create Staging Tables

### Customers

In [121]:
with open('/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/customers_2.csv') as file:
    customers = list(csv.reader(file))
    for customer in customers[:5]:
        print(customer)

['sale_id', 'customer_id', 'first_name', 'last_name', 'street', 'city', 'state', 'zip']
['5763728874', '3728404', 'Darrelle', 'Dohrmann', '46 Farwell Terrace', 'Oakland', 'CA', '94609']
['5763729036', '3729309', 'Moria', 'Greenwood', '8803 Delaware Crossing', 'Berkeley', 'CA', '94705']
['5763728904', '3728508', 'Josiah', 'Hulett', '6755 Melby Plaza', 'Oakland', 'CA', '94612']
['5763728973', '3728534', 'Gayle', 'MacGarrity', '286 Onsgard Center', 'Berkeley', 'CA', '94703']

In [122]:
query = '''

CREATE TABLE customers_2 (
    sale_id numeric(10),
    customer_id numeric(10),
    first_name varchar(25),
    last_name varchar(25),
    street varchar(50),
    city varchar(50),
    state char(2),
    zip_code char(5),
    PRIMARY KEY (sale_id, customer_id)
)

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Line Items

In [123]:
with open('/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/line_items_2.csv') as file:
    line_items = list(csv.reader(file))
    for line_item in line_items[:5]:
        print(line_item)

['sale_id', 'line_item_id', 'product_id', 'price', 'quantity', 'taxable']
['5763728874', '1', '42314680', '12', '1', 'N']
['5763729036', '1', '42314677', '12', '1', 'N']
['5763729036', '2', '42314682', '12', '3', 'N']
['5763729036', '3', '42314684', '12', '2', 'N']

In [124]:
query = '''

CREATE TABLE line_items_2 (
    sale_id numeric(10),
    line_item_id numeric(5),
    product_id numeric(10),
    price numeric(5),
    quantity numeric(5),
    taxable boolean,
    PRIMARY KEY (sale_id, line_item_id)
)

'''
try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Product Mappings

In [125]:
with open('/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/product_mappings_2.csv') as file:
    product_mappings = list(csv.reader(file))
    for product_mapping in product_mappings[:5]:
        print(product_mapping)

['product_id_1', ' product_id']
['1', '42314677']
['2', '42314678']
['3', '42314679']
['4', '42314680']

In [126]:
query = '''

CREATE TABLE product_mappings_2 (
    product_id_1 numeric(5) PRIMARY KEY,
    product_id numeric(10)
)

'''
try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Sales

In [127]:
with open('/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/sales_2.csv') as file:
    sales = list(csv.reader(file))
    for sale in sales[:5]:
        print(sale)

['sale_id', 'date', 'sub_total', 'tax', 'total']
['5763728874', '2020-10-03', '12', '0', '12']
['5763729036', '2020-10-03', '72', '0', '72']
['5763728904', '2020-10-03', '24', '0', '24']
['5763728973', '2020-10-03', '96', '0', '96']

In [128]:
query = '''

CREATE TABLE sales_2 (
    sale_id numeric(10),
    date date,
    subtotal numeric(5),
    tax numeric(5),
    total numeric(5)
)

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Stores

In [129]:
with open('/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/stores_2.csv') as file:
    stores = list(csv.reader(file))
    for store in stores[:5]:
        print(store)

['sale_id', 'store_id', 'name', 'street', 'city', 'state', 'zip']
['5763728874', '12573', 'Acme Gourmet Meals', '3000 Telegraph Ave', 'Berkeley', 'CA', '94705']
['5763729036', '12573', 'Acme Gourmet Meals', '3000 Telegraph Ave', 'Berkeley', 'CA', '94705']
['5763728904', '12573', 'Acme Gourmet Meals', '3000 Telegraph Ave', 'Berkeley', 'CA', '94705']
['5763728973', '12573', 'Acme Gourmet Meals', '3000 Telegraph Ave', 'Berkeley', 'CA', '94705']

In [130]:
query = '''

CREATE TABLE stores_2 (
    sale_id numeric(10),
    store_id numeric(5),
    name varchar(25),
    street varchar(50),
    city varchar(50),
    state char(2),
    zip_code char(5),
    PRIMARY KEY (sale_id, store_id)
)

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

## Load

### Customers

In [131]:
query = '''

COPY customers_2 (sale_id, customer_id, first_name, last_name, street, city, state, zip_code)
FROM '/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/customers_2.csv'
DELIMITER ','
CSV HEADER;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Line Items

In [132]:
query = '''

COPY line_items_2 (sale_id, line_item_id, product_id, price, quantity, taxable)
FROM '/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/line_items_2.csv'
DELIMITER ','
CSV HEADER;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Product Mappings

In [133]:
query = '''

COPY product_mappings_2 (product_id_1, product_id)
FROM '/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/product_mappings_2.csv'
DELIMITER ','
CSV HEADER;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Sales

In [134]:
query = '''

COPY sales_2 (sale_id, date, subtotal, tax, total)
FROM '/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/sales_2.csv'
DELIMITER ','
CSV HEADER;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

### Stores

In [135]:
query = '''

COPY stores_2 (sale_id, store_id, name, street, city, state, zip_code)
FROM '/Users/bryguan/Documents/GitHub/acme-sales-analysis/Data 2/stores_2.csv'
DELIMITER ','
CSV HEADER;

'''

try:
    with connection.begin():
        connection.execute(text(query))
except Exception as e:
    print(f' Error {e}')

## Verify Load

### Customers

In [136]:
query = '''

SELECT *
FROM customers_2;

'''

display(pd.read_sql_query(query, connection))

,sale_id,customer_id,first_name,last_name,street,city,state,zip_code
0,5.763729e+09,3728404.0,Darrelle,Dohrmann,46 Farwell Terrace,Oakland,CA,94609
1,5.763729e+09,3729309.0,Moria,Greenwood,8803 Delaware Crossing,Berkeley,CA,94705
2,5.763729e+09,3728508.0,Josiah,Hulett,6755 Melby Plaza,Oakland,CA,94612
3,5.763729e+09,3728534.0,Gayle,MacGarrity,286 Onsgard Center,Berkeley,CA,94703
4,5.763729e+09,3729188.0,Courtenay,Shirrell,75 West Park,Emeryville,CA,94608
...,...,...,...,...,...,...,...,...
92,5.763729e+09,3728568.0,Valina,Spring,119 Sachtjen Junction,Berkeley,CA,94702
93,5.763729e+09,3728990.0,Claire,Mebes,358 Oxford Road,Albany,CA,94706
94,5.763729e+09,3728901.0,Freddy,Mumford,6 Transport Lane,Orinda,CA,94563
95,5.763729e+09,3729019.0,Arv,Doret,2120 Mesta Circle,Emeryville,CA,94608
96,5.763729e+09,3728691.0,Eula,Dewair,3 Crownhardt Road,Albany,CA,94706

### Line Items

In [137]:
query = '''

SELECT *
FROM line_items_2;

'''

display(pd.read_sql_query(query, connection))

          sale_id  line_item_id  product_id  price  quantity  taxable
0    5.763729e+09           1.0  42314680.0   12.0       1.0    False
1    5.763729e+09           1.0  42314677.0   12.0       1.0    False
2    5.763729e+09           2.0  42314682.0   12.0       3.0    False
3    5.763729e+09           3.0  42314684.0   12.0       2.0    False
4    5.763729e+09           1.0  42314680.0   12.0       1.0    False
..            ...           ...         ...    ...       ...      ...
347  5.763729e+09           2.0  42314678.0   12.0       2.0    False
348  5.763729e+09           3.0  42314682.0   12.0       2.0    False
349  5.763729e+09           1.0  42314677.0   12.0       2.0    False
350  5.763729e+09           2.0  42314678.0   12.0       1.0    False
351  5.763729e+09           3.0  42314682.0   12.0       1.0    False

[352 rows x 6 columns]

### Product Mappings

In [138]:
query = '''

SELECT *
FROM product_mappings_2;

'''

display(pd.read_sql_query(query, connection))

   product_id_1  product_id
0           1.0  42314677.0
1           2.0  42314678.0
2           3.0  42314679.0
3           4.0  42314680.0
4           5.0  42314681.0
5           6.0  42314682.0
6           7.0  42314683.0
7           8.0  42314684.0

### Sales

In [139]:
query = '''

SELECT *
FROM sales_2;

'''

display(pd.read_sql_query(query, connection))

         sale_id        date  subtotal  tax  total
0   5.763729e+09  2020-10-03      12.0  0.0   12.0
1   5.763729e+09  2020-10-03      72.0  0.0   72.0
2   5.763729e+09  2020-10-03      24.0  0.0   24.0
3   5.763729e+09  2020-10-03      96.0  0.0   96.0
4   5.763729e+09  2020-10-03     108.0  0.0  108.0
..           ...         ...       ...  ...    ...
92  5.763729e+09  2020-10-03      72.0  0.0   72.0
93  5.763729e+09  2020-10-03      48.0  0.0   48.0
94  5.763729e+09  2020-10-03      84.0  0.0   84.0
95  5.763729e+09  2020-10-03      60.0  0.0   60.0
96  5.763729e+09  2020-10-03      48.0  0.0   48.0

[97 rows x 5 columns]

### Stores

In [140]:
query = '''

SELECT *
FROM stores_2;

'''

display(pd.read_sql_query(query, connection))

,sale_id,store_id,name,street,city,state,zip_code
0,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
1,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
2,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
3,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
4,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
...,...,...,...,...,...,...,...
92,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
93,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
94,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
95,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705
96,5.763729e+09,12573.0,Acme Gourmet Meals,3000 Telegraph Ave,Berkeley,CA,94705

## Close Connection

In [141]:
connection.close()
engine.dispose()